{
    "homePage": {
        "title": "Tomás Gonzalez Humphreys",
        "description": "Software Engineer with experience building data-intensive and full-stack systems. I currently work at Deloitte developing internal tools that process millions of financial records using Python, SQL, and DuckDB. I also build web applications with Java (Spring Boot) and React, focusing on clean architecture, correctness, and maintainability. I am looking for a team-based job with real ownership and a focus on product.",
        "projectsButton": "View my projects",
        "cvButton": "Download CV"
    },
    "about": {
        "title": "About Me",
        "description": "Software Engineer with experience analyzing, developing, and validating software solutions across backend and data-intensive environments. Strong background in Python, Java, and React, with hands-on experience identifying logical errors, performance issues, and data inconsistencies. Able to clearly explain technical concepts in written Spanish and English, with a strong focus on code correctness, reliability, and structured feedback. Comfortable collaborating with non-technical stakeholders. Presented technical solutions and data outputs to regional Tax leadership at a Big Tech client, explaining data logic, validations, and results.",
        "nextSteps": {
            "title": "Next steps",
            "description": "I’m currently around 60% through my Computer Science Engineering degree, balancing academic challenges with real-world experience building time-saving software in my current role. I’m actively strengthening my backend skills with Java and Spring Boot, aiming to grow as a Full Stack Engineer capable of building robust and scalable systems."
        },
        "jobOpportunities": {
            "title": "Job Opportunities",
            "description": "For my next role, I’m especially interested in joining an engineering team where collaboration, technical discussions, and shared ownership are part of the daily work. I value environments where engineers learn from each other through reviews, design decisions, and collective problem-solving. I’m looking for remote opportunities with flexible or asynchronous schedules."
        }
    },
    "nav": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "experience": "Experience",
        "contact": "Contact"
    },
    "projects": {
        "title": "Projects",
        "items": [
            {
                "title": "Deloitte – Financial Data Processing Platform",
                "technologies": [
                    "Python",
                    "Pandas",
                    "DuckDB",
                    "SQL Server"
                ],
                "description": [
                    "Developed and maintained Python-based data tools processing large datasets, prioritizing data accuracy, validation logic, and reliability in outputs.",
                    "Built automated workflows and pipelines for data aggregation, transformation and integration with SQL Server and DuckDB execution layers.",
                    "Collaborated with stakeholders to clarify data requirements and translate them into technical solutions with documented logic and reproducible results.",
                    "Ensured end-to-end correctness and traceability of critical data processes used in financial and operational reporting contexts."
                ]
            },
            {
                "title": "Puros Mates – Full-Stack E-commerce",
                "technologies": [
                    "Java",
                    "Spring Boot",
                    "React",
                    "MySQL"
                ],
                "description": "Full-stack e-commerce system with REST API backend and admin panel."
            }
        ]
    },
    "experience": {
        "title": "Experience",
        "items": [
            {
                "role": "Systems Specialist",
                "company": "Deloitte",
                "period": "June 2025 – Present",
                "description": [
                    "Developed and maintained internal Python-based data tools processing millions of records, with a strong focus on data correctness, validation rules, and reproducible outputs for financial operations.",
                    "Designed automated pipelines for data ingestion, transformation, and aggregation using Pandas, Polars, DuckDB, and SQL Server, integrating multiple encrypted Excel sources.",
                    "Built end-to-end solutions, from requirements gathering with stakeholders to deployment in corporate environments, ensuring traceability and auditability of data flows.",
                    "Collaborated closely with non-technical and technical stakeholders to translate business rules into deterministic, testable data logic used in operational and accounting reporting."
                ]
            },
            {
                "role": "Full Stack Developer",
                "company": "Puros Mates (Personal Bussines)",
                "period": "",
                "description": [
                    "Designed and implemented a full stack ecommerce application using React (Redux) on the frontend and Java with Spring Boot on the backend.",
                    "Built REST APIs with Spring Boot, JPA, and MySQL, following layered architecture principles (Controller, Service, Data) to ensure maintainability and clear separation of concerns.",
                    "Developed a scalable product catalog and admin-oriented data flows, focusing on predictable state management and data consistency across layers.",
                    "Applied systematic debugging and problem-solving practices to maintain correctness across frontend state, backend logic, and persistence layers."
                ]
            }
        ]
    },
    "contact": {
        "title": "Contact",
        "description": "If you’re building a product-driven team and need an engineer who can work across backend, data, and frontend, feel free to reach out."
    }
}