{
    "homePage": {
        "title": "Tomás Gonzalez Humphreys",
        "description": "Ingeniero de software con experiencia en sistemas full-stack y procesamiento de datos. Actualmente trabajo en Deloitte desarrollando herramientas internas que procesan millones de registros contables usando Python, Pandas, SQL y DuckDB. También construyo aplicaciones web con Java (Spring Boot) y React, enfocándome en arquitectura limpia, confiabilidad y mantenibilidad. Estoy buscando trabajar en equipos, con ownership real y foco en producto.",
        "projectsButton": "Ver mis proyectos",
        "cvButton": "Descargar CV"
    },
    "about": {
        "title": "Sobre mí",
        "description": "Software Engineer con experiencia en el desarrollo de herramientas internas de alto impacto, procesando millones de registros y optimizando flujos de datos críticos en el sector contable en Deloitte. Soy un Software Engineer con foco en backend con Java y Spring Boot, diseño de APIs, bases de datos relacionales y frontend moderno con React. Perfil colaborativo, orientado a producto y con mentalidad de ownership. Tengo ingles fluido, nivel B2, el cual me permite comunicarme fluidamente.",
        "nextSteps": {
            "title": "Próximos pasos",
            "description": "Actualmente me encuentro cursando la carrera de Ingeniería en Informática, con aproximadamente un 60% de avance, combinando los desafíos académicos con experiencia profesional desarrollando software que genera impacto real en mi equipo de trabajo. Estoy enfocado en seguir profundizando mis conocimientos en Java y Spring Boot, con el objetivo de consolidar un perfil Full Stack orientado a sistemas robustos y escalables."
        },
        "jobOpportunities": {
            "title": "Oportunidades Laborales",
            "description": "En esta nueva etapa profesional, busco incorporarme a un equipo de ingeniería donde el trabajo colaborativo, el intercambio técnico y el aprendizaje entre pares sean parte del día a día. Me interesa trabajar en entornos remotos, idealmente con cierta flexibilidad horaria, que permitan un buen equilibrio entre trabajo, estudio y crecimiento profesional."
        }
    },
    "nav": {
        "home": "Inicio",
        "about": "Sobre mí",
        "projects": "Proyectos",
        "experience": "Experiencia",
        "contact": "Contacto"
    },
    "projects": {
        "title": "Proyectos",
        "items": [
            {
                "title": "Deloitte – Plataforma de procesamiento de datos",
                "technologies": [
                    "Python",
                    "Pandas",
                    "DuckDB",
                    "SQL Server"
                ],
                "description": "Aplicación interna para procesar y validar millones de registros financieros."
            },
            {
                "title": "Puros Mates – E-commerce Full-Stack",
                "technologies": [
                    "Java",
                    "Spring Boot",
                    "React",
                    "MySQL"
                ],
                "description": "Sistema de e-commerce completo con panel de administración y API REST."
            }
        ]
    },
    "experience": {
        "title": "Experiencia",
        "items": [
            {
                "role": "Senior Software Engineer",
                "company": "Tech Corp",
                "period": "2023 - Presente",
                "description": "Liderando el desarrollo de microservicios y optimización de bases de datos."
            },
            {
                "role": "Full Stack Developer",
                "company": "StartUp Inc",
                "period": "2021 - 2023",
                "description": "Desarrollo de features end-to-end usando React y Node.js."
            }
        ]
    },
    "contact": {
        "title": "Contacto",
        "description": "Si estás construyendo un producto y buscás a alguien que pueda trabajar en backend, data y frontend, escribime.",
        "email": "gonzaleztomas.contacto@gmail.com",
        "github": "https://github.com/tomasitogh",
        "linkedin": "https://www.linkedin.com/in/tomas-gonzalez-humphreys"
    }
}